Tekla Open API Reference for Tekla Structures 2025
TransformationPlane.ToString Method
 Returns a string representation of the matrices that transform to local and global coordinates.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string representation of the matrices that transform to local and global coordinates.
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace